cf_billing/DataProcessors/бестРеестрНачисленийСбербанк.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бестРеестрНачисленийСбербанк</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчетыПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчетыПоМесяцам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Comment>Организации</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФормаУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФормыУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>энргНаименованиеОперацииОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестКодОрганизацииВнутриГоловнойОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестРежимРаботыОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестДатаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращённое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/DataProcessors/бестРеестрНачисленийСбербанк/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыгрузитьНаСервереМодуль(Текст, ТекПараметры) Экспорт
	
	Запрос	= Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Текпараметры.Организация);
	Запрос.Текст = "ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП,
	|	БанковскиеСчета.НомерСчета КАК НомерСчета
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ПО БанковскиеСчета.Владелец = Организации.Ссылка
	|ГДЕ
	|	Организации.Ссылка = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	БанковскиеСчета.НомерСчета,
	|	Организации.Ссылка,
	|	Организации.ИНН,
	|	Организации.КПП";
	Результат = Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	Выборка.Следующий();
	Текпараметры.Вставить("ИНН", Выборка.ИНН);
	Текпараметры.Вставить("НомерСчета", Выборка.НомерСчета);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 	Текпараметры.Организация);
	Запрос.УстановитьПараметр("Дата", 		Текпараметры.ПериодНачисления);
	Запрос.Текст = "ВЫБРАТЬ
	               |	энргАбоненты.Ссылка КАК Ссылка,
	               |	энргАбоненты.ЛицевойСчет КАК ЛицевойСчет,
	               |	энргАбонентыКонтактнаяИнформация.Представление КАК Представление,
	               |	энргАбоненты.Организация КАК Организация,
	               |	энргАбоненты.Район КАК Район,
	               |	энргАбоненты.Наименование КАК Наименование,
	               |	энргКлючиПомещений.Строение КАК Строение,
	               |	энргКлючиПомещений.Помещение КАК Помещение
	               |ПОМЕСТИТЬ ВрТ0
	               |ИЗ
	               |	Справочник.энргАбоненты КАК энргАбоненты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
	               |		ПО (энргАбонентыКонтактнаяИнформация.Ссылка = энргАбоненты.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	               |		ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.Ссылка
	               |ГДЕ
	               |	НЕ энргАбоненты.ПометкаУдаления
	               |	И энргАбоненты.Организация = &Организация
	               |	И НЕ энргАбоненты.ЭтоГруппа
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргАбоненты.Ссылка,
	               |	энргАбоненты.ЛицевойСчет,
	               |	энргАбонентыКонтактнаяИнформация.Представление,
	               |	энргАбоненты.Организация,
	               |	энргАбоненты.Район,
	               |	энргАбоненты.Наименование,
	               |	энргКлючиПомещений.Строение,
	               |	энргКлючиПомещений.Помещение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТ0.Ссылка КАК Абонент,
	               |	ВрТ0.ЛицевойСчет КАК ЛицевойСчет,
	               |	ВЫРАЗИТЬ(ВрТ0.Представление КАК СТРОКА(300)) КАК Адрес,
	               |	ВрТ0.Организация КАК Организация,
	               |	ВрТ0.Район КАК Район,
	               |	ВрТ0.Наименование КАК Наименование,
	               |	ВрТ0.Строение КАК Строение,
	               |	ВрТ0.Помещение КАК Помещение
	               |ПОМЕСТИТЬ ВрТ1
	               |ИЗ
	               |	ВрТ0 КАК ВрТ0
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеЛС.СрезПоследних(&Дата, ) КАК энргСостояниеЛССрезПоследних
	               |		ПО ВрТ0.Ссылка = энргСостояниеЛССрезПоследних.Абонент
	               |			И ВрТ0.Организация = энргСостояниеЛССрезПоследних.Организация
	               |			И ВрТ0.Район = энргСостояниеЛССрезПоследних.Район
	               |			И (энргСостояниеЛССрезПоследних.Состояние)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВрТ0.Ссылка,
	               |	ВрТ0.ЛицевойСчет,
	               |	ВЫРАЗИТЬ(ВрТ0.Представление КАК СТРОКА(300)),
	               |	ВрТ0.Организация,
	               |	ВрТ0.Район,
	               |	ВрТ0.Наименование,
	               |	ВрТ0.Строение,
	               |	ВрТ0.Помещение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТ1.Абонент КАК Абонент,
	               |	ВрТ1.ЛицевойСчет КАК ЛицевойСчет,
	               |	ВрТ1.Адрес КАК Адрес,
	               |	ЕСТЬNULL(энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток, 0) КАК Сумма,
	               |	ВрТ1.Наименование КАК АбонентСтрока,
	               |	ВрТ1.Строение КАК Строение,
	               |	ВрТ1.Помещение КАК Помещение
	               |ПОМЕСТИТЬ ВрТ2
	               |ИЗ
	               |	ВрТ1 КАК ВрТ1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(&Дата, ) КАК энргВзаиморасчетыПоМесяцамОстатки
	               |		ПО ВрТ1.Абонент = энргВзаиморасчетыПоМесяцамОстатки.Абонент
	               |			И ВрТ1.Организация = энргВзаиморасчетыПоМесяцамОстатки.Организация
	               |			И ВрТ1.Район = энргВзаиморасчетыПоМесяцамОстатки.Район
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТ2.Абонент КАК Абонент,
	               |	ВрТ2.ЛицевойСчет КАК ЛицевойСчет,
	               |	СУММА(ВрТ2.Сумма) КАК Сумма,
	               |	ВрТ2.АбонентСтрока КАК АбонентСтрока,
	               |	ВЫБОР
	               |		КОГДА ВрТ2.Адрес = """"
	               |				ИЛИ ВрТ2.Адрес ЕСТЬ NULL
	               |			ТОГДА ЕСТЬNULL(энргСтроения.Наименование, """") + "", "" + ЕСТЬNULL(энргПомещения.Наименование, """")
	               |		ИНАЧЕ ВрТ2.Адрес
	               |	КОНЕЦ КАК Адрес,
	               |	энргСтроения.ДомДляСортировки КАК ДомДляСортировки,
	               |	энргПомещения.НомерДляСортировки КАК НомерДляСортировки,
	               |	энргПомещения.Ссылка КАК Ссылка,
	               |	энргСтроения.Ссылка КАК Ссылка1
	               |ИЗ
	               |	ВрТ2 КАК ВрТ2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСтроения КАК энргСтроения
	               |		ПО ВрТ2.Строение = энргСтроения.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	               |		ПО ВрТ2.Помещение = энргПомещения.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргСтроения.ДомДляСортировки,
	               |	ВрТ2.АбонентСтрока,
	               |	ВрТ2.Абонент,
	               |	ВрТ2.ЛицевойСчет,
	               |	энргПомещения.НомерДляСортировки,
	               |	энргПомещения.Ссылка,
	               |	энргСтроения.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ВрТ2.Адрес = """"
	               |				ИЛИ ВрТ2.Адрес ЕСТЬ NULL
	               |			ТОГДА ЕСТЬNULL(энргСтроения.Наименование, """") + "", "" + ЕСТЬNULL(энргПомещения.Наименование, """")
	               |		ИНАЧЕ ВрТ2.Адрес
	               |	КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДомДляСортировки,
	               |	НомерДляСортировки
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Результат = Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	
	Тело		= "";
	Пока Выборка.Следующий() ЦИкл
		Тело = Тело + Строка(Выборка.ЛицевойСчет) + ";" + СОКРЛ(Строка(Выборка.АбонентСтрока)) + ";" + Строка(Выборка.Адрес) + ";" + Строка(Формат(ТекПараметры.ПериодНачисления, "ДФ=MMyy")) + ";" + СтрЗаменить(Строка(Выборка.Сумма), Символы.НПП, "") + ";" + Символы.ПС; 		
	КонецЦикла;
	
	Тело		= СОКРЛП(Тело);
	
	Текст.ДобавитьСтроку(Тело);	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
